Autodesk.Revit.DB.Architecture.RailingType.SecondaryHandrailHeight
The height of the secondary handrail.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The rail has no secondary hand rail.
Since:
2013

Autodesk.Revit.DB.Architecture.RailingType.PrimaryHandrailHeight
The height of the primary handrail.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The rail has no primary hand rail.
Since:
2013

Autodesk.Revit.DB.Architecture.RailingType.SecondaryHandrailLateralOffset
The lateral offset of the secondary handrail.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The rail has no secondary hand rail.
Since:
2013

Autodesk.Revit.DB.Architecture.RailingType.PrimaryHandrailLateralOffset
The lateral offset of the primary handrail.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The rail has no primary hand rail.
Since:
2013

Autodesk.Revit.DB.Architecture.RailingType.SecondaryHandrailType
The type of the secondary handrail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The handRailTypeId is not a valid hand rail type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.RailingType.PrimaryHandrailType
The type of the primary handrail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The handRailTypeId is not a valid hand rail type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.RailingType.TopRailType
The type of the top rail in the railing system.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The topRailType is not a valid top rail type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.RailingType.TopRailHeight
The height of the top rail in the railing system.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for height must be between 0 and 30000 feet.
Since:
2013

Autodesk.Revit.DB.Architecture.RailingType.SecondaryHandRailPosition
The position of the secondary handrail.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The rail has no secondary hand rail.
Since:
2013

Autodesk.Revit.DB.Architecture.RailingType.PrimaryHandRailPosition
The position of the primary handrail.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The rail has no primary hand rail.
Since:
2013

Autodesk.Revit.DB.Architecture.RailingType.RailStructure
The NonContinuousRailStructure.
Since:
2019

Autodesk.Revit.DB.Architecture.RailingType.BalusterPlacement
Accesses the object containing properties related to the baluster placement.
Since:
2019

Autodesk.Revit.DB.Architecture.RailingType
An object supporting management of baluster and post placement within the railing type.
Since:
2013